Revit 2024 API
GroupTypeId.ElectricalLighting Property
 Electrical - Lighting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId ElectricalLighting { get; }
Visual Basic
Public Shared ReadOnly Property ElectricalLighting As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ElectricalLighting {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace